tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mongodb/brew"
tap "osgeo/osgeo4mac"
tap "vitorgalvao/tiny-scripts"
cask "adoptopenjdk"
cask "osxfuse"
brew "gcc"
brew "open-mpi"
brew "openblas"
brew "hdf5"
brew "autoconf"
brew "autojump"
brew "automake"
brew "python"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bfg"
brew "ccache"
brew "circleci"
brew "cmake"
brew "convmv"
brew "coreutils"
brew "curl"
brew "libssh2"
brew "exa"
brew "exiftool"
brew "flac"
brew "lame"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "git"
brew "git-lfs"
brew "go"
brew "gsl"
brew "htop"
brew "hub"
brew "igraph"
brew "libomp"
brew "imagemagick"
brew "ksh"
brew "lapack"
brew "leiningen"
brew "lesspipe"
brew "libav"
brew "libxml2"
brew "libgit2"
brew "libiconv"
brew "libressl"
brew "librsvg"
brew "libxslt"
brew "llvm@7"
brew "mariadb-connector-c"
brew "mas"
brew "md5sha1sum", link: false
brew "neofetch"
brew "neovim"
brew "node"
brew "numpy"
brew "pandoc"
brew "pandoc-citeproc"
brew "pandoc-crossref"
brew "parallel"
brew "pipx"
brew "pkg-config"
brew "podofo"
brew "protobuf"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "rename"
brew "rsync"
brew "ruby"
brew "rust"
brew "rustup-init"
brew "screen"
brew "shellcheck"
brew "shellharden"
brew "sox"
brew "sshfs"
brew "tcl-tk"
brew "tcsh"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "tree"
brew "udunits"
brew "v8"
brew "vim"
brew "wget"
brew "winetricks"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "mongodb/brew/mongodb-community"
brew "osgeo/osgeo4mac/osgeo-gdal"
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "1password"
cask "alacritty"
cask "alfred"
cask "aspera-connect"
cask "authy"
cask "basictex"
cask "bbedit"
cask "bibdesk"
cask "calibre"
cask "carbon-copy-cloner"
cask "coconutbattery"
cask "coda"
cask "deluge"
cask "docker"
cask "emacs"
cask "fiji"
cask "firefox"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "gpg-suite"
cask "hazel"
cask "igv"
cask "iterm2"
cask "java"
cask "julia"
cask "keka"
cask "kid3"
cask "kitty"
cask "libreoffice"
cask "little-snitch"
cask "makemkv"
cask "mongodb"
cask "museeks"
cask "netnewswire"
cask "omnidisksweeper"
cask "onyx"
cask "r"
cask "rstudio"
cask "safari-technology-preview"
cask "skype"
cask "slack"
cask "spillo"
cask "sublime-text"
cask "superduper"
cask "textmate"
cask "torbrowser"
cask "tower"
cask "transmit"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "wine-stable"
cask "xld"
cask "xquartz"
mas "Bear", id: 1091189122
mas "Calca", id: 635758264
mas "Disk Speed Test", id: 425264550
mas "EasyFind", id: 411673888
mas "Gapplin", id: 768053424
mas "Howler Timer", id: 428846772
mas "iA Writer", id: 775737590
mas "iBatch for iTunes", id: 889032538
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Name Mangler", id: 603637384
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
mas "Reeder", id: 880001334
mas "Soulver", id: 413965349
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 1384080005
