# """
# Homebrew Bundle Brewfile.
# Updated 2020-07-17.
#
# See also:
# - https://github.com/Homebrew/homebrew-bundle
# - https://www.caseyliss.com/2019/10/8/brew-bundle
# - https://gist.github.com/cliss/74782128b9a35366ecac44a7c4b45752
# """

# Taps {{{1
# ==============================================================================

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mongodb/brew"
tap "vitorgalvao/tiny-scripts"

# Casks {{{1
# ==============================================================================

# 'foobar2000' cask was removed due to url protection.
# 'macvim' cask overwrites 'vim' binary, so install manually instead.
# 'skype-for-business' is potentially useful but starts up at login.

# Requires authentication in 'Security & Privacy':
# - box-drive
# - virtualbox

# Consider:
# - fiji  # latest
# - onyx
# - oracle-jdk
# - wine-stable

# Casks that don't auto-update correctly:
# - bibdesk
# - firefox
# - tunnelblick
# - visual-studio-code
# - iterm

# Priority {{{2
# ------------------------------------------------------------------------------

cask "osxfuse"
cask "xquartz"

# Alphabetical {{{1
# ------------------------------------------------------------------------------

cask "1password"
cask "adobe-acrobat-reader"
cask "adoptopenjdk"  # igv
cask "aerial"
cask "alacritty"
cask "alfred"
cask "aspera-connect"
cask "authy"
cask "basictex"
cask "bbedit"
cask "bibdesk"
cask "calibre"
cask "carbon-copy-cloner"
cask "coconutbattery"
cask "coda"
cask "colloquy"
cask "darktable"
cask "deluge"
cask "docker"
cask "emacs"
cask "firefox"
cask "github"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"  # latest
cask "google-drive-file-stream"  # latest
cask "gpg-suite"
cask "handbrake"
cask "hazel"
cask "igv"
cask "iterm2"
cask "java"
cask "julia"
cask "keka"
cask "kid3"
cask "kitty"
cask "libreoffice"
cask "little-snitch"
cask "makemkv"
cask "museeks"
cask "netnewswire"
cask "omnidisksweeper"
cask "pacifist"
cask "photosweeper-x"
cask "powershell"
cask "pycharm-ce"
cask "r"
cask "rstudio"
cask "safari-technology-preview"
cask "scrivener"
cask "skype"
cask "spillo"
cask "sublime-text"
cask "superduper"
cask "swinsian"
cask "textmate"
cask "tiny-player"
cask "tor-browser"
cask "tower"
cask "transmit"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xld"
cask "zoomus"

# Brews {{{1
# ==============================================================================

# Rust: Use cargo to manage packages instead: broot, exa, fd, ripgrep, xsv.

# Shells {{{2
# ------------------------------------------------------------------------------

brew "bash"
brew "dash"
brew "fish"
brew "ksh"
brew "tcsh"
brew "zsh"

# Priority {{{2
# ------------------------------------------------------------------------------

brew "python@3.8"

brew "libssh2"
brew "libtool"
brew "libxml2"

brew "gcc"
brew "open-mpi"
brew "openblas"
brew "hdf5"
brew "sqlite"
brew "tcl-tk"
brew "tesseract"

brew "proj"
brew "gdal"

# Alphabetical {{{2
# ------------------------------------------------------------------------------

brew "ack"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "azure-cli"
brew "bash-completion"
brew "bfg"
brew "binutils"
brew "ccache"
brew "checkbashisms"
brew "circleci"
brew "cmake"
brew "convmv"
brew "coreutils"
brew "curl"
brew "exiftool"
brew "ffmpeg"
brew "findutils"
brew "flac"
brew "fzf"
brew "gawk"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "go"
brew "gpatch"
brew "grep"
brew "groff"
brew "gsl"
brew "htop"
brew "httpd"
brew "hub"
brew "igraph"
brew "imagemagick"
brew "jq"
brew "lame"
brew "lapack"
brew "leiningen"
brew "lesspipe"
brew "libav"
brew "libgit2"
brew "libiconv"
brew "libomp"
brew "libressl"
brew "librsvg"
brew "libxslt"
brew "llvm"
brew "lua"
brew "luarocks"
brew "make"
brew "man-db"
brew "mariadb-connector-c"
brew "mas"
brew "mkvtoolnix"
brew "mp4v2"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "openssh"
brew "pandoc"
brew "pandoc-citeproc"
brew "pandoc-crossref"
brew "parallel"
brew "pass"
brew "php"
brew "pkg-config"
brew "podofo"
brew "protobuf"
brew "rename"
brew "rsync"
brew "ruby"
brew "screen"
brew "shellcheck"
brew "shellharden"
brew "shunit2"
brew "sox"
brew "sshfs"
brew "subversion"
brew "taglib"
brew "texinfo"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "udunits"
brew "v8"
brew "vim"
brew "wget"
brew "youtube-dl"
brew "zlib"

# External brews {{{2
# ------------------------------------------------------------------------------

brew "mongodb/brew/mongodb-community"
brew "vitorgalvao/tiny-scripts/cask-repair"

# Mac App Store {{{1
# ==============================================================================

mas "Calca", id: 635758264
mas "Disk Speed Test", id: 425264550
mas "EasyFind", id: 411673888
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "Instapaper", id: 1481302432
mas "Internet Access Policy Viewer", id: 1482630322
mas "Keynote", id: 409183694
mas "Name Mangler", id: 603637384
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
mas "Reeder", id: 880001334
mas "Soulver", id: 413965349
mas "Table Tool", id: 1122008420
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 1384080005
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
