# """
# Homebrew Bundle Brewfile.
# Updated 2020-11-10.
# """

# Brews {{{1
# ==============================================================================

# Python: Can use official Framework binary install instead of Homebrew.
# Use 'install-python-framework' from koopa to install.
brew "python@3.9", link: false

brew "ack"
brew "armadillo"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "azure-cli"
brew "bandcamp-dl"
brew "bash"
brew "bash-completion"
brew "bat"  # rust
brew "bfg"
brew "binutils"
brew "black"  # python
brew "broot"  # rust
brew "ccache"
brew "checkbashisms"
brew "circleci"
brew "cmake"
brew "cmus"
brew "convmv"
brew "coreutils"
brew "curl"
brew "dash"
brew "dog"  # rust
brew "dust"  # rust
brew "exa"  # rust
brew "exiftool"
brew "fd"  # rust
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "flac"
brew "flake8"  # python
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdal"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "go"
brew "gpatch"
brew "grep"
brew "groff"
brew "gsl"
brew "hdf5"
brew "htop"
brew "httpd"
brew "hub"
brew "hyperfine"
brew "igraph"
brew "imagemagick"
brew "jq"
brew "ksh"
brew "lame"
brew "lapack"
brew "leiningen"
brew "lesspipe"
brew "libav"
brew "libgit2"
brew "libiconv"
brew "libomp"
brew "libressl"
brew "librsvg"
brew "libssh2"
brew "libtool"
brew "libxml2"
brew "libxslt"
brew "llvm"
brew "lua"
brew "luarocks"
brew "make"
brew "man-db"
brew "mariadb-connector-c"
brew "mas"
brew "mkvtoolnix"
brew "mp4v2"
brew "mpc"
brew "mpd"
brew "ncmpcpp"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "open-mpi"
brew "openblas"
brew "openssh"
brew "osx-cpu-temp"
brew "pandoc"
brew "pandoc-citeproc"
brew "pandoc-crossref"
brew "parallel"
brew "pass"
brew "pcre"
brew "php"
brew "pkg-config"
brew "podofo"
brew "procs"  # rust
brew "proj"
brew "protobuf"
brew "pylint"  # python
brew "ranger"  # python
brew "rename"
brew "ripgrep"  # rust
brew "rsync"
brew "ruby"
## > brew "rust"
## > brew "rustup-init"  # rust
brew "screen"
brew "shellcheck"
brew "shellharden"
brew "shunit2"
brew "sox"
brew "sqlite"
brew "sshfs"
brew "starship"  # rust
brew "subversion"
brew "taglib"
brew "tcl-tk"
brew "tcsh"
brew "tesseract"
brew "texinfo"
brew "the_silver_searcher"
brew "tmux"
brew "tokei"  # rust
brew "trash"
brew "udunits"
brew "v8"
brew "vim"
brew "wget"
brew "xsv"  # rust
brew "youtube-dl"
brew "zlib"
brew "zoxide"  # rust
brew "zsh"
